# Makefile для сборки mhx

# Имя исходного и выходного файла
SRC = mhx.c
OUT = mhx

# Оптимизационные флаги для релиза
CFLAGS = -O2 -s -Wall

# Команда для компиляции
CC = gcc

# Правило по умолчанию (сборка)
all: $(OUT)

# Правило для компиляции исходного файла в исполнимый файл
$(OUT): $(SRC)
	$(CC) $(CFLAGS) -o $(OUT) $(SRC)

# Правило для очистки временных файлов
clean:
	rm -f $(OUT)

# Правило для установки
install: $(OUT)
	# Замените на команду установки, если нужно
	cp $(OUT) /usr/local/bin/

.PHONY: all clean install

